{
  "ir_version": "1.0",
  "project": "aiassistkit",
  "repository": "https://github.com/agentplexus/aiassistkit",
  "versioning": "semver",
  "commit_convention": "conventional",
  "maintainers": ["agentplexus"],
  "releases": [
    {
      "version": "v0.4.0",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Migration to agentplexus organization with hooks package for AI assistant lifecycle events" }
      ],
      "added": [
        { "description": "`hooks` package with adapters for AI assistant lifecycle hooks (Claude, Cursor, Windsurf)" },
        { "description": "`hooks/core` with canonical hook types, events, and adapter interface" },
        { "description": "`hooks/claude` adapter for Claude Code hooks (PreToolUse, PostToolUse, etc.)" },
        { "description": "`hooks/cursor` adapter for Cursor IDE hooks" },
        { "description": "`hooks/windsurf` adapter for Windsurf hooks" }
      ],
      "changed": [
        { "description": "Module path changed from `github.com/grokify/aiassistkit` to `github.com/agentplexus/aiassistkit`" }
      ],
      "dependencies": [
        { "description": "Added `github.com/agentplexus/multi-agent-spec/sdk/go` for multi-agent specifications" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Automated marketplace publishing with GitHub PR creation" }
      ],
      "added": [
        { "description": "`publish` package for automated plugin submission to AI assistant marketplaces", "commit": "f51322d" },
        { "description": "`publish/claude` adapter for Claude Code marketplace (anthropics/claude-plugins-official)", "commit": "f51322d" },
        { "description": "`publish/github` client wrapper using gogithub for GitHub API operations", "commit": "f51322d" }
      ],
      "dependencies": [
        { "description": "Added `github.com/grokify/gogithub` v0.5.0 for GitHub API utilities", "commit": "f51322d" },
        { "description": "Added `github.com/google/go-github/v81` for GitHub API client", "commit": "f51322d" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Multi-platform agent generation with new AWS adapters and genagents CLI" }
      ],
      "added": [
        { "description": "`agents/agentkit` adapter for AWS AgentKit/Agent Builder JSON format", "commit": "d49e2f5" },
        { "description": "`agents/awsagentcore` adapter for AWS CDK TypeScript code generation", "commit": "d49e2f5" },
        { "description": "`cmd/genagents` CLI for multi-platform agent generation from canonical specs", "commit": "5bcd07e" }
      ],
      "documentation": [
        { "description": "Comprehensive MkDocs documentation site with Material theme", "commit": "2ca28b3" },
        { "description": "Release notes section with v0.1.0 and v0.2.0 notes", "commit": "ab6ec4e" }
      ],
      "infrastructure": [
        { "description": "GitHub Actions workflow for MkDocs gh-pages deployment", "commit": "70d0053" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-12",
      "highlights": [
        { "description": "Initial release with unified configuration management for AI coding assistants supporting 9 tools" }
      ],
      "added": [
        { "description": "`mcp` package with adapters for MCP server configurations (Claude, Cursor, Windsurf, VS Code, Codex, Cline, Roo, Kiro)", "commit": "ae9f762" },
        { "description": "`context` package with converter for generating CLAUDE.md from CONTEXT.json", "commit": "50bacd7" },
        { "description": "`agents` package with adapters for AI assistant agent definitions (Claude, Codex, Gemini, Kiro)", "commit": "b62c572" },
        { "description": "`commands` package with adapters for slash command definitions (Claude, Codex, Gemini)", "commit": "7578daf" },
        { "description": "`plugins` package with adapters for plugin/extension configurations (Claude, Gemini)", "commit": "76ba9cf" },
        { "description": "`skills` package with adapters for reusable skill definitions (Claude, Codex)", "commit": "e532fc1" },
        { "description": "`teams` package for multi-agent team orchestration with process types (sequential, parallel, hierarchical)", "commit": "5c75117" },
        { "description": "`validation` package with configuration validators (Claude, Codex, Gemini)", "commit": "95ec174" },
        { "description": "Adapter pattern with canonical types and tool-specific converters", "commit": "ae9f762" },
        { "description": "Self-registering adapters via `init()` for automatic discovery", "commit": "ae9f762" },
        { "description": "JSON Schema validation for plugins, commands, skills, agents, teams, and validation configs", "commit": "95ec174" }
      ],
      "documentation": [
        { "description": "PRD.md product requirements document", "commit": "a741e66" },
        { "description": "TRD.md technical requirements document", "commit": "a741e66" },
        { "description": "ROADMAP.md and ROADMAP.json for project planning", "commit": "a741e66" },
        { "description": "README.md with installation and usage examples", "commit": "a741e66" },
        { "description": "PRESENTATION.md Marp slides for project overview", "commit": "a741e66" }
      ]
    }
  ]
}
